БухЭксп/Catalogs/CW_ИсторияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ИсторияОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СобытияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ИсторияОбъектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = "Запись журнала ("+Объект.Дата+")";
	ЭтаФорма.ТолькоПросмотр=Истина;
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры



&НаКлиенте
Процедура ТестоваяОтправка(Команда)
	
	_ОтправитьСообщение();
	
КонецПроцедуры

&НаСервере
Процедура _ОтправитьСообщение()
	// --- 
	
	Сервер = "172.16.150.220";
	Порт="3000";
	Путь = "/send";
	
	Получатель = "ollowtf@jabber.ru";
	ТелоСообщения = Формат(Объект.Дата)+Символы.ПС+ПолучитьНавигационнуюСсылку(Объект.Ссылка)+Символы.ПС+Строка(Объект.Событие);
	//СтруктураДанных = Новый Структура("jid,body", Получатель, ТелоСообщения);
	ЗаписьДанных = Новый ЗаписьJSON;
	ЗаписьДанных.УстановитьСтроку();
	ЗаписьДанных.ЗаписатьНачалоОбъекта();
	ЗаписьДанных.ЗаписатьИмяСвойства("jid");
	ЗаписьДанных.ЗаписатьЗначение(Получатель);
	ЗаписьДанных.ЗаписатьИмяСвойства("body");
	ЗаписьДанных.ЗаписатьЗначение(ТелоСообщения);
	ЗаписьДанных.ЗаписатьКонецОбъекта();
	СтрокаДанных = ЗаписьДанных.Закрыть();
	
	Соединение = Новый HTTPСоединение(Сервер,Порт);
	Запрос = Новый HTTPЗапрос(Путь);
	Запрос.Заголовки.Вставить("content-type","application/json");
	Запрос.УстановитьТелоИзСтроки(СтрокаДанных,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	Результат = Соединение.ОтправитьДляОбработки(Запрос); // POST
	
	// --- 
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
